cmsis-svd/cmsis-svd/data/Atmel/ATSAMD21G17AU.svd
        <register>
          <name>WAKEUP</name>
          <description>Wake-Up Enable</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAKEUPEN0</name>
              <description>External Interrupt 0 Wake-up Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN1</name>
              <description>External Interrupt 1 Wake-up Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN2</name>
              <description>External Interrupt 2 Wake-up Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN3</name>
              <description>External Interrupt 3 Wake-up Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN4</name>
              <description>External Interrupt 4 Wake-up Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN5</name>
              <description>External Interrupt 5 Wake-up Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN6</name>
              <description>External Interrupt 6 Wake-up Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN7</name>
              <description>External Interrupt 7 Wake-up Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN8</name>
              <description>External Interrupt 8 Wake-up Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN9</name>
              <description>External Interrupt 9 Wake-up Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN10</name>
              <description>External Interrupt 10 Wake-up Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN11</name>
              <description>External Interrupt 11 Wake-up Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN12</name>
              <description>External Interrupt 12 Wake-up Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN13</name>
              <description>External Interrupt 13 Wake-up Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN14</name>
              <description>External Interrupt 14 Wake-up Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUPEN15</name>
              <description>External Interrupt 15 Wake-up Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CONFIG%s</name>
          <description>Configuration n</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SENSE0</name>
              <description>Input Sense 0 Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE0Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising-edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling-edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both-edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High-level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low-level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN0</name>
              <description>Filter 0 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE1</name>
              <description>Input Sense 1 Configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE1Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN1</name>
              <description>Filter 1 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE2</name>
              <description>Input Sense 2 Configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE2Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN2</name>
              <description>Filter 2 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE3</name>
              <description>Input Sense 3 Configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE3Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN3</name>
              <description>Filter 3 Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE4</name>
              <description>Input Sense 4 Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE4Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN4</name>
              <description>Filter 4 Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE5</name>
              <description>Input Sense 5 Configuration</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE5Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN5</name>
              <description>Filter 5 Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE6</name>
              <description>Input Sense 6 Configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE6Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN6</name>
              <description>Filter 6 Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE7</name>
              <description>Input Sense 7 Configuration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE7Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN7</name>
              <description>Filter 7 Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
